tap "auth0/auth0-cli"
tap "encoredev/tap"
tap "felixkratz/formulae"
tap "filosottile/musl-cross"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "julien-cpsn/atac"
tap "nikitabobko/tap"
tap "sergiobenitez/osxct"
tap "supabase/tap"
# Run your GitHub Actions locally
brew "act"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Diff that understands syntax
brew "difftastic"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# QUIC transport protocol implementation
brew "mvfst"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# OpenType text shaping engine
brew "harfbuzz"
# Database version control to control migrations
brew "flyway"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for database change tracking
brew "liquibase"
# Powerful, lightweight programming language
brew "lua"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Modern shell for the GitHub era
brew "nushell"
# Framework for layout and rendering of i18n text
brew "pango"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@15"
# Object-relational database system
brew "postgresql@16"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Generate type safe Go from SQL
brew "sqlc"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Watch files and take action when they change
brew "watchman"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# High-performance, asynchronous messaging library
brew "zeromq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Build, manage and test your Auth0 integrations from the command line
brew "auth0/auth0-cli/auth0"
# The static analysis-powered Go framework for building backend applications
brew "encoredev/tap/encore"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Linux cross compilers based on musl libc
brew "filosottile/musl-cross/musl-cross"
# Terraform Language Server
brew "hashicorp/tap/terraform-ls"
# A simple API client (postman like) in your terminal
brew "julien-cpsn/atac/atac"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Desktop password and login vault
cask "bitwarden"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# System monitor for the menu bar
cask "stats"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
